---
kind: method
id: M:Autodesk.Revit.DB.PanelTypeSet.ReverseIterator
source: html/4d3573ed-4e0c-09ae-d29b-59c1dc36d051.htm
---
# Autodesk.Revit.DB.PanelTypeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual PanelTypeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.